puts "じゃんけん..."
puts "0（グー）1（チョキ）2（パー）"
game = ""

loop do

  if game === 0 || game === 1
    puts "じゃんけん..."
    puts "0（グー）1（チョキ）2（パー）"
  end

  zibun_hand = gets.chomp.to_i
  aite_hand = rand(3)

  if game === 2
    puts "ショ！"
  elsif
    puts "ホイ！"
  end

  if zibun_hand === 0
    case aite_hand
    when 0
      puts "--------------------------"
      puts "あなたはグーを出しました"
      puts "相手はグーを出しました"
      puts "--------------------------"
      puts "あいこで..."
      puts "0（グー）1（チョキ）2（パー）"
      game = 2
    when 1
      puts "--------------------------"
      puts "あなたはグーを出しました"
      puts "相手はチョキを出しました"
      puts "--------------------------"
      game = 0
    when 2
      puts "--------------------------"
      puts "あなたはグーを出しました"
      puts "相手はパーを出しました"
      puts "--------------------------"
      game = 1
    end

  elsif zibun_hand === 1
    case aite_hand
    when 0
      puts "--------------------------"
      puts "あなたはチョキを出しました"
      puts "相手はグーを出しました"
      puts "--------------------------"
      game = 1
    when 1
      puts "--------------------------"
      puts "あなたはチョキを出しました"
      puts "相手はチョキを出しました"
      puts "--------------------------"
      puts "あいこで..."
      puts "0（グー）1（チョキ）2（パー）"
      game = 2
    when 2
      puts "--------------------------"
      puts "あなたはチョキを出しました"
      puts "相手はパーを出しました"
      puts "--------------------------"
      game = 0
    end

  elsif zibun_hand === 2
    case aite_hand
    when 0
      puts "--------------------------"
      puts "あなたはパーを出しました"
      puts "相手はグーを出しました"
      puts "--------------------------"
      game = 0
    when 1
      puts "--------------------------"
      puts "あなたはパーを出しました"
      puts "相手はチョキを出しました"
      puts "--------------------------"
      game = 1
    when 2
      puts "--------------------------"
      puts "あなたはパーを出しました"
      puts "相手はパーを出しました"
      puts "--------------------------"
      puts "あいこで..."
      puts "0（グー）1（チョキ）2（パー）"
      game = 2
    end
  end

  if game === 1  #相手がジャンケンに勝利
    puts "あっち向いて..."
    puts "0(上)1(下)2(左)3(右)"
    zibun_face = gets.chomp.to_i
    aite_fing = rand(4)

    puts "ホイ！"

    if zibun_face === 0
      case aite_fing
      when 0
        puts "--------------------------"
        puts "あなた：上"
        puts "相手：上"
        puts "--------------------------"
        puts "敗北しました"
        break
      when 1
        puts "--------------------------"
        puts "あなた：上"
        puts "相手：下"
        puts "--------------------------"
      when 2
        puts "--------------------------"
        puts "あなた：上"
        puts "相手：左"
        puts "--------------------------"
      when 3
        puts "--------------------------"
        puts "あなた：上"
        puts "相手：右"
        puts "--------------------------"
      end

    elsif zibun_face === 1
      case aite_fing
      when 0
        puts "--------------------------"
        puts "あなた：下"
        puts "相手：上"
        puts "--------------------------"
      when 1
        puts "--------------------------"
        puts "あなた：下"
        puts "相手：下"
        puts "--------------------------"
        puts "敗北しました"
        break
      when 2
        puts "--------------------------"
        puts "あなた：下"
        puts "相手：左"
        puts "--------------------------"
      when 3
        puts "--------------------------"
        puts "あなた：下"
        puts "相手：右"
        puts "--------------------------"
      end

    elsif zibun_face === 2
      case aite_fing
      when 0
        puts "--------------------------"
        puts "あなた：左"
        puts "相手：上"
        puts "--------------------------"
      when 1
        puts "--------------------------"
        puts "あなた：左"
        puts "相手：下"
        puts "--------------------------"
      when 2
        puts "--------------------------"
        puts "あなた：左"
        puts "相手：左"
        puts "--------------------------"
        puts "敗北しました"
        break
      when 3
        puts "--------------------------"
        puts "あなた：左"
        puts "相手：右"
        puts "--------------------------"
      end

    elsif zibun_face === 3
      case aite_fing
      when 0
        puts "--------------------------"
        puts "あなた：右"
        puts "相手：上"
        puts "--------------------------"
      when 1
        puts "--------------------------"
        puts "あなた：右"
        puts "相手：下"
        puts "--------------------------"
      when 2
        puts "--------------------------"
        puts "あなた：右"
        puts "相手：左"
        puts "--------------------------"
      when 3
        puts "--------------------------"
        puts "あなた：右"
        puts "相手：右"
        puts "--------------------------"
        puts "敗北しました"
        break
      end
    end

  elsif game === 0  #自分がジャンケンに勝利
    puts "あっち向いて..."
    puts "0(上)1(下)2(左)3(右)"
    zibun_face = gets.chomp.to_i
    aite_fing = rand(4)

    puts "ホイ！"

    if zibun_face === 0
      case aite_fing
      when 0
        puts "--------------------------"
        puts "あなた：上"
        puts "相手：上"
        puts "--------------------------"
        puts "勝利しました"
        break
      when 1
        puts "--------------------------"
        puts "あなた：上"
        puts "相手：下"
        puts "--------------------------"
      when 2
        puts "--------------------------"
        puts "あなた：上"
        puts "相手：左"
        puts "--------------------------"
      when 3
        puts "--------------------------"
        puts "あなた：上"
        puts "相手：右"
        puts "--------------------------"
      end

    elsif zibun_face === 1
      case aite_fing
      when 0
        puts "--------------------------"
        puts "あなた：下"
        puts "相手：上"
        puts "--------------------------"
      when 1
        puts "--------------------------"
        puts "あなた：下"
        puts "相手：下"
        puts "--------------------------"
        puts "勝利しました"
        break
      when 2
        puts "--------------------------"
        puts "あなた：下"
        puts "相手：左"
        puts "--------------------------"
      when 3
        puts "--------------------------"
        puts "あなた：下"
        puts "相手：右"
        puts "--------------------------"
      end

    elsif zibun_face === 2
      case aite_fing
      when 0
        puts "--------------------------"
        puts "あなた：左"
        puts "相手：上"
        puts "--------------------------"
      when 1
        puts "--------------------------"
        puts "あなた：左"
        puts "相手：下"
        puts "--------------------------"
      when 2
        puts "--------------------------"
        puts "あなた：左"
        puts "相手：左"
        puts "--------------------------"
        puts "勝利しました"
        break
      when 3
        puts "--------------------------"
        puts "あなた：左"
        puts "相手：右"
        puts "--------------------------"
      end

    elsif zibun_face === 3
      case aite_fing
      when 0
        puts "--------------------------"
        puts "あなた：右"
        puts "相手：上"
        puts "--------------------------"
      when 1
        puts "--------------------------"
        puts "あなた：右"
        puts "相手：下"
        puts "--------------------------"
      when 2
        puts "--------------------------"
        puts "あなた：右"
        puts "相手：左"
        puts "--------------------------"
      when 3
        puts "--------------------------"
        puts "あなた：右"
        puts "相手：右"
        puts "--------------------------"
        puts "勝利しました"
        break
      end
    end
  end
end
